<template>
  <div>
    <CommonBanner
      title="联合培养项目"
      :sub-title="'院校合作办学（ 3+0/1/2)— 重点推荐外方院校'"
      :img="imgList[0]"
    ></CommonBanner>
    <!-- <img class="top-bg" :src="cdn + '/content-top-bg.png'" alt="" />
    <img class="footer-bg" :src="cdn + '/content-footer-bg.png'" alt="" /> -->

    <div class="content">
      <div class="mb-24">
        <template v-for="(school, index) of schoolList" :key="school.id">
          <div v-bind:id="school.id" class="mb-16">
            <Title2 class="mb-11">{{ school.schoolName }}</Title2>
            <div class="grid grid-cols-2 gap-10">
              <div>
                <HighLight
                  :high-light="school.highLight"
                  v-if="school.highLight"
                ></HighLight>
                <div
                  :innerHTML="school.content"
                  class="text-[#666] text-lg leading-9 font-normal mt-10"
                ></div>
              </div>
              <div>
                <img
                  class="w-full"
                  :src="imgList[index + 1]"
                  alt=""
                  srcset=""
                />
              </div>
            </div>
          </div>
        </template>
      </div>
    </div>
    <div class="pb-12">
      <ToTop />
    </div>
  </div>
</template>
<script lang="ts" setup>
import config from "@/config";

const STATIC_PATH = `${config.cdn}/joint-training/`;
const { cdn } = config;
const imgList = [
  `${STATIC_PATH}banner.png`,
  `${STATIC_PATH}pic_01.png`,
  `${STATIC_PATH}pic_02.png`,
  `${STATIC_PATH}pic_03.png`,
  `${STATIC_PATH}pic_04.png`,
  `${STATIC_PATH}pic_05.png`,
  `${STATIC_PATH}pic_06.png`,
  `${STATIC_PATH}pic_07.png`,
  `${STATIC_PATH}pic_08.png`,
  `${STATIC_PATH}pic_09.png`,
  `${STATIC_PATH}pic_10.png`,
  `${STATIC_PATH}pic_11.png`,
];
const schoolList = [
  {
    id: "01",
    schoolName: "澳大利亚拉萨尔设计学院（LCI Melbourne ）",
    highLight:
      "伦敦大学创意学院墨尔本分校,<br/>是一所位于澳大利亚墨尔本的著名艺术与设计学院",
    content:
      "• LCI Melbourne（伦敦大学创意学院墨尔本分校）是一所位于澳大利亚墨尔本的著名艺术与设计学院。它是LCI教育网络的一部分，该网络在全球拥有超过60年的教育和培训经验，并在五大洲拥有23个校区。LCI Melbourne专注于提供高质量的艺术与设计教育，为学生开启了通往创意行业的职业道路。<br/>• LCI Melbourne提供多种专业课程，其中包括设计艺术学士学位。这个学位在澳大利亚是独一无二的，也是维多利亚州唯一提供的此类学位。学生可以选择多个专业领域进行深入学习，如时尚与服装设计、影视制作与摄影、平面与数字设计、室内设计、视觉艺术等。该学院的学士学位课程设计灵活，使学生能够在两年内完成学业。<br/>• 除了学士学位课程，LCI Melbourne还提供高等教育文凭课程，作为通往学士学位的途径。这些课程包括时尚设计和平面设计等领域。学院的教育理念是将传统与创新相结合，提供丰富的资源和机会，使学生能够在艺术和设计领域取得成功。<br/>• LCI Melbourne的新校园于2018年在Collingwood的Foy & Gibson仓库区开放。这个经过精心改造的建筑拥有先进的设施，如公共艺术画廊、编辑套房和行业标准的工作室。该区域是创意的中心，拥有多家艺术画廊、时尚公司和设计工作室，为学生提供了许多本地的专业实习机会。",
  },
  {
    id: "02",
    highLight:
      "毕业生就业率在90%以上，在加拿大非常突出<br/>提供英语或法语授课，毕业后获得三年工作签",
    content:
      "• 加拿大蒙特利尔拉萨尔学院（LaSalle College Montreal）成立于1959年，位于蒙特利尔市中心，是加拿大著名的高等院校之一。这所学院在技术职业培训领域享有卓越声誉，现有学生超过3500人，来自50多个国家，是加拿大最大的私立双语技术学院。拉萨尔学院每年获得魁北克省约一亿多元人民币的经费支持。。开设DEC(DCS)高教文凭、 DEP(DVS)职业培训和AEC(ACS)证书这三大类专业课，所有专业均可英语或法 语授课，毕业后都可以申请获得3年的毕业工作签证。<br/>• 学院提供多种专业课程，包括服装设计、服装营销、酒店管理、旅游、工商管理、会计、计算机科学、电脑绘画、二维三维动画设计、动画游戏设计、多媒体、室内设计、美容等。拉萨尔学院得到魁北克教育部认可，提供由教育部承认的专科文凭和毕业证书。<br/>• 拉萨尔学院的教育理念注重学生成功率的提升，保证所有毕业生都通晓所学的科目。学院集团会员活跃于技术职业专业培训教育、授学位技术教育、企业培训、在线培训、国际项目开发管理、咨询服务、软件开发、人才交流培训、技术转让、CAD/CAM系统产品开发和房地产开发等多项事业。<br/>• 除了蒙特利尔校区，拉萨尔学院在温哥华也有分校，并且是拉萨尔学院集团国际网络的心脏，拥有全球23所附属学院。这些附属学院分布在北美、南美、亚洲、非洲和欧洲。在中国，拉萨尔学院有2所附属学院或与中国教育机构合作的项目，位于苏州和宁波。<br/>• 拉萨尔学院为学生提供二年到三年的大专文凭专业（DEC）和技术培训证书专业（AEC）课程。这些专业在就业市场受到高度的评价和广泛的欢迎。学院也提供短期培训课程。拉萨尔学院在设置课程时，重视和采纳工业界领袖和一流企业家根据工作场所的需求作出的建议。<br/>• 拉萨尔学院的毕业生就业率在90%以上，这在加拿大是非常突出的。学院设有就业辅导室，专职就业顾问免费指导学生就业。学院提供英语或法语授课，为学生提供专业工作或继续求学深造所需的基本技能。",
    schoolName: "加拿大蒙特利尔拉萨尔学院（LaSalle College Montreal ）",
  },
  {
    id: "03",
    schoolName: "加拿大诺奎斯特学院（Norquest College）",
    highLight:
      "伦敦大学创意学院墨尔本分校,<br/>是一所位于澳大利亚墨尔本的著名艺术与设计学院",
    content:
      "• 诺奎斯特学院是加拿大一所公立学院，始建于1965年。诺奎斯特学院由四个校区组成，主校区设于阿省首府埃德蒙顿市中心，独占地利。另外三个校区分别位于埃德蒙顿西山，斯托尼普莱恩和韦塔斯基温。诺奎斯特学院主校区设于埃德蒙顿的诺亚斯特学院是阿省第四大社区学院，学校人数约有10000，每年毕业生超过2000名。<br/>• 学校还设有多个社区学习站点，为在职人士提供方便的进修学习地点。阿省政府于2005年9月拨款100万加元，资助该校扩充市中心校舍。该校为国际学生提供的课程主要分为以下三大类：提供文凭和证书课程的职业培训、开办多样化的英语课程的ESL英语研修、为17岁以上的成年学生提供的高中及大学预备课程。<br/>• 加拿大诺奎斯特学院是一所由理事会管理的公立大学，是一个综合性的社区机构，遵循“阿尔伯塔省高等教育法”。作为高等教育提升途径的领军者，该学院在学术进修、成人读写能力、就业准备和英语强化教育的基础学习课程方面都得到了广泛认可。学院颁发的证书包括资格证书、大专文凭和应用型学历证书。<br/>• 诺奎斯特学院具有浓厚的国际化氛围，为10000多名学生服务，非加拿大本土学生比例超过四分之一，使用语言有70多种。近年，诺奎斯特学院非常重视创新教育，与地方产业密切合作，开展了灵活多样的课程项目。",
  },
  {
    id: "04",
    schoolName: "马耳他旅游研究学院（Institute of Tourism Studies）",
    highLight: "旅游业和酒店业工作的专业人员的技能和再技能",
    content:
      "• 马耳他旅游研究学院（以下简称ITS）是马耳他专门培养旅游及酒店管理人才的高等院校，开设旅游学、酒店管理、烹饪学、游轮管理等专业，授予学士学位及高等职业学历文凭。隶属马耳他旅游部，其学历得到欧盟多个旅游及酒店教育行业协会认可，在中国教育部网站备案学历互认。<br/>• 自1987年成立以来，ITS一直致力于提供该领域的高质量教育。学院经验丰富、尽职尽责的讲师提供多样化的学习课程，确保学生既能学到理论知识，又能接受实践培训。<br/>• ITS与阿联酋酒店管理学院(EAHM)等著名院校建立了学术联系，该学院的旅游与酒店管理专业在全球排名第13位，在中东和非洲地区排名第1位。此外，ITS还与国际一流大学和机构签订了协议，使学院的学生能够出国留学，获得符合国际标准的全面教育。ITS与芬兰Haaga-Helia应用科学大学和法国Lyfe学院等著名合作伙伴合作，分别开设了国际酒店管理和烹饪艺术学士学位课程。<br/>• ITS提供以行业为重点的培训课程，旨在提高已在旅游业和酒店业工作的专业人员的技能和再技能。这些课程可根据公司的具体需求量身定制，确保行业专业人员能够不断更新，适应行业不断发展的需求。",
  },
  {
    id: "05",
    schoolName: "瑞士沙夫豪森大学（Hochschulinstitut Schaffhausen）",
    highLight: "特别强调实践性学习，提供灵活的学习方式",
    content:
      "• 马耳他旅游研究学院（以下简称ITS）是马耳他专门培养旅游及酒店管理人才的高等院校，开设旅游学、酒店管理、烹饪学、游轮管理等专业，授予学士学位及高等职业学历文凭。隶属马耳他旅游部，其学历得到欧盟多个旅游及酒店教育行业协会认可，在中国教育部网站备案学历互认。<br/>• 自1987年成立以来，ITS一直致力于提供该领域的高质量教育。学院经验丰富、尽职尽责的讲师提供多样化的学习课程，确保学生既能学到理论知识，又能接受实践培训。<br/>• ITS与阿联酋酒店管理学院(EAHM)等著名院校建立了学术联系，该学院的旅游与酒店管理专业在全球排名第13位，在中东和非洲地区排名第1位。此外，ITS还与国际一流大学和机构签订了协议，使学院的学生能够出国留学，获得符合国际标准的全面教育。ITS与芬兰Haaga-Helia应用科学大学和法国Lyfe学院等著名合作伙伴合作，分别开设了国际酒店管理和烹饪艺术学士学位课程。<br/>• ITS提供以行业为重点的培训课程，旨在提高已在旅游业和酒店业工作的专业人员的技能和再技能。这些课程可根据公司的具体需求量身定制，确保行业专业人员能够不断更新，适应行业不断发展的需求。",
  },
  {
    id: "06",
    schoolName: "匈牙利肖普朗大学（University of Sopron）",
    highLight: "2023年泰晤士高等教育大学影响力排名1001+",
    content:
      "• 肖普朗大学的历史可以追溯到几个世纪以前，原是匈牙利西部大学(UNIVERSITY OF WEST HUNGA-RY)。始建于1735年的林业科技大学，位于塞尔梅班亚(现属斯洛伐克的一部分),培养了大量采矿、林业和冶金方面的专业人员。作为一个古老学府的继承者，第一次世界大战后，该学府于1919年迁至肖普朗，2000年1月1日，7所学院合并，更名为西匈牙利大学，即大家所熟悉的西部大学。<br/><br/>• 2017年该大学进行了重组，将SOPRON以外的院系与其他大学合并，再次更名为肖普朗大学。经过了几次结构调整，目前肖普朗大学共有四个学院：贝内德克埃莱克教育学学院、林业学院、亚历山大兰姆法鲁西经济学院和西蒙伊卡罗里工程、林业和艺术学院。<br/><br/>• 现如今，肖普朗大学是匈牙利高等教育的顶尖学府之一，其师资力量在匈牙利排名第一，并有两位诺贝尔奖获得者在学校任教，是一所以“绿色理念”著称的综合性大学。",
  },
  {
    id: "07",
    schoolName: "奥地利西伯格堡私立大学（Privatuniversität Schloss Seeburg）",
    highLight:
      "致力于为学生提供一个国际化的学习环境，并且强调跨文化能力的培养。",
    content:
      "• 西堡城堡大学成立于2007年，是一所国家认可的私立大学，现在有超过1000名学生在西堡城堡大学学习商业心理学、工商管理或体育与活动管理。除了独特的城堡氛围外，该大学在学术层面上创造和传授具有实际和社会意义的知识，鼓励学生进行独立、自主的思考。<br/>• 通过国际合作和师生交流项目促进不同文化之间的接触和理解，与世界各地的伙伴大学和公司保持联系。积极寻求教学、研究和继续教育方面的国际合作。目前大学教学法的研究结果不断被纳入我们的半虚拟研究的方法论概念中。通过半虚拟学习的概念，西堡城堡大学为欧洲的高等教育部门和企业家继续教育发挥了创新作用，也实现并促进了兼职学习。<br/>• 西堡城堡大学已被授予奥地利质量保证和认证机构（AQ奥地利）的质量印章。大学课程是根据PrivHG第10a条第9款的规定设立的，所有学术学位都具有国际可比 性并得到认可 。 在评估门户网 站fernstudiumcheck.de上，该大学在学习内容、灵活性和支持方面的得分特别高。",
  },
  {
    id: "08",
    schoolName: "新加坡理工学院（Singapore Polytechnic）",
    highLight:
      "首批获得中国教育部认证的新加坡院校之一，<br/>其教育水平和文凭在全球范围内都受到广泛认可",
    content:
      "• 新加坡理工学院（Singapore Polytechnic）是一所位于新加坡的知名公立理工学院，创立于1954年。这所学院在新加坡的教育体系中扮演着重要角色，以其实用性和与工作的接轨而闻名。首批获得中国教育部认证的新加坡院校之一，其教育水平和文凭在全球范围内都受到广泛认可。<br/>• 新加坡理工学院提供多种专业课程，如建筑环境与设计、商业、化学和生命科学、电器科学和电子工程技术、信息科学与通讯技术、机械学和制造工程、海运等。学院还采用了设计思维方法教学，并拥有先进的硬件设施，例如亚洲第一个香水和化妆品中心、Cyber Wargame中心、F1汽车模拟器以及容纳SP所有飞机Aero Hub等。<br/>• 申请条件方面，一般来说，国际学生需要满足一定的学术和英语语言能力要求。例如，对于英语语言能力的要求，学生通常需要通过如雅思（IELTS）或托福（TOEFL）等标准化考试来证明。新加坡理工学院的申请条件可能会根据所选课程和专业的不同而有所变化。<br/>• 新加坡理工学院的一年学费大约需要10000新币左右。",
  },
  {
    id: "09",
    schoolName: "新加坡南洋理工学院（Nanyang Polytechnic，简称NYP）",
    highLight: "推动创新项目和应用研究，培养学生的研发能力",
    content:
      "南洋理工学院（Nanyang Polytechnic，简称NYP）是新加坡政府所属的一所理工科高等学府，成立于1992年。它是新加坡政府为满足国家经济和人才需求而建立的五所国立理工学院之一。南洋理工学院提供多种专业课程的文凭，包括商业管理、化学与生命科学、设计、工程、卫生与社会科学、信息技术、互动与数字媒体等领域。学院着重培养与训练复合型人才，推动新加坡科技、经济和社会文化的发展。南洋理工学院的办学理念包括“教学工厂”、“综合科技环境”、“经验积累与分享（AES）”、“无界化校园”及“4C”特色（学院文化、创新理念、技能开发和企业联系）。这些理念体现了学院对职业教育的重视和学院文化的特色。<br/>- NYP鼓励学生发展创新思维和创业精神。学院设有创新和企业中心，为学生提供发展创业项目和学习企业管理技巧的机会。<br/>- 学院定期举办研讨会和工作坊，邀请行业专家来校内分享经验，并给予学生实际的业务指导与支持。<br/>- NYP为学生提供行业认可的资格证书和技能认证课程。这些课程有助于学生在相应的专业领域获得更高的职业地位和更好的就业机会。<br/>- 学院还透过在职培训和生命长学项目，提供专业进修的途径，帮助在职人士保持知识技能的更新和提升。NYP与多所海外大学建立了合作关系，提供学位转换课程和进阶学习路径。这些合作使得NYP毕业生能够更加顺利地迈向大学学习阶段。<br/>- NYP努力保持其设施的现代化和技术的先进性，以便学生能够学习和应用最新的技术。学校的教育模式经常结合最新的技术趋势，比如人工智能、虚拟现实和大数据分析等，以确保学生的技能与当代工业界的需求保持一致。",
  },
  {
    id: "10",
    schoolName:
      "马来西亚林国荣创意科技大学（Limkokwing University of Creative Technology）",
    highLight: "与澳洲、加拿大等国进行学分互、艺术类马来西亚首选院校",
    content:
      "马来西亚林国荣创意科技大学马来西亚林国荣创意科技大学（Limkokwing University of Creative Technology），是亚洲知名的高水平特色大学，同时也是马来西亚艺术类专业大学排名第一的院校。这所大学以其全球化的创意教育视野而闻名，获得了马来西亚政府及社会的广泛肯定与认同。马来西亚教育部曾为林国荣创意科技大学颁发了国际学生最高入读率奖和全球化教育特别奖，而马来西亚国际贸易和工业部为其颁发过杰出人才输出奖。<br/>在2017年6月发布的2018版QS世界大学排名中，林国荣创意科技大学位居亚洲第219位。该校与世界多所知名大学有着紧密的合作关系，引进并开设了加拿大、英国、美国、澳洲等国著名大学的大专、本科、硕士课程。在数码、动画、广告、多媒体与广播、影像与数码艺术、电视与电影、商业、时装设计、室内设计、产品设计、大众传播等学科领域表现优异。<br/>林国荣创意科技大学提供60多个学位和专业课程，括大专、本科和硕士课程。包括数码、动画、广告、多媒体与广播、影像与数码艺术、电视与电影、商业、时装设计、室内设计、产品设计、大众传播等；包括世界著名大学的学士学位课程，并可将学分转移至澳大利亚、加拿大等国继续深造。其资格及学术水平广受世界承认。在海外方面，该校也囊括了许多国际奖项，包括法兰克福欧洲科技质量奖、伦敦国际质量奖、日内瓦时代世纪国际质量白金奖、巴黎国际金星奖、纽约全球世纪领导人创新教育奖等。",
  },
  {
    id: "11",
    schoolName:
      "德国康斯特大学  [原]  不来梅雅各布大学 （Constructor University）",
    highLight:
      "泰晤士高等教育世界大学排名（THE）：251-300<Br/>泰晤士高等教育世界年轻大学排名（THE）：26",
    content:
      "• 不来梅雅各布大学（Jacobs University Bremen）是德国不来梅市一所获得国家认可的私立大学。该校是德国最具国际性的学术机构之一，具有真正的跨文化团队的特点。不来梅雅各布大学成立于 2001 年，吸引了来自世界各地优秀且思想开放的学生：来自 100 多个国家的 1300 多名学生目前正在该校学习。不来梅雅各布大学提供从自然科学和社会科学到工程和经济学的一系列的本科、硕士和博士课程，并且几乎所有的学习课程都采用英语授课方式。<br/><br/>• 该校高质量的教育水平体现在应用创新课程、聘用高素质教师、保证学生密集辅导等方面。通过在不来梅雅各布大学的学习，学生们在学术教育方面可以获得跨文化交流能力，并为在德国本地以及国际化就业做好了充分的准备。<br/><br/>• 2022年11月，不来梅雅各布大学更名为康斯特大学（Constructor University）。",
  },
];
</script>

<style lang="scss" scoped>
.top-bg {
  position: absolute;
  right: 0;
  top: 40rem;
}
.footer-bg {
  position: absolute;
  bottom: 0;
  left: 0rem;
}
.content {
  width: $content-width;
  margin: auto;
  padding: 6rem 0 3rem;
  img {
    display: inline-block;
    width: 90rem;
    position: relative;
  }

  p {
    text-indent: 2em;
    line-height: 3rem;
  }
}
.child-item {
  background-repeat: no-repeat;
  background-size: cover;
  padding: 2rem;
  position: relative;
  overflow: hidden;
  color: white;
  cursor: pointer;
  div {
    position: relative;
    z-index: 10;
  }
  .mask {
    position: absolute;
    width: 100%;
    height: 100%;
    margin-left: -2rem;
    margin-bottom: -2rem;
  }
  &:hover {
    .mask {
      background: linear-gradient(
        180deg,
        rgba(0, 26, 51, 0.3) 0%,
        rgba(0, 13, 26, 0.5) 100%
      );
    }
  }
  div:last-child {
    font-size: 1.5rem;
    font-weight: bold;
    line-height: 2rem;

    font-family: PingFangSC-Semibold, PingFang SC;
  }
}
</style>
